
//Уровень 3.4 задачника JavaScript
//№1
for(let i = 10; i <= 1000; i++) {
    if(parseInt(i.toString()[0]) % 2 === 0) {
        console.log(i);
    }
}

//Выведите в консоль все числа в промежутке от 10 до 1000, у которых первая цифра четная.

//№2


//Дан некоторый массив, например, вот такой:

//[1, 2, 3, 4, 5, 6]
//Поменяйте местами пары элементов этого массива:

//[2, 1, 4, 3, 6, 5]
let arr = [1, 2, 3, 4, 5, 6];
for(let i = 0; i < arr.length; i += 2) {
    let temp = arr[i];
    arr[i] = arr[i+1];
    arr[i+1] = temp;
}
console.log(arr);
//№3

//Дан следующий объект:

//let obj = {
	//1: {
		//1: 11,
		//2: 12,
		//3: 13,
	//},
	//2: {
		//1: 21,
		//2: 22,
		//3: 23,
	//},
	//3: {
	//	1: 24,
	//	2: 25,
		//3: 26,
	///},
//}
//Найдите сумму элементов этого объекта.
let obj8 = {
    1: {
        1: 11,
        2: 12,
        3: 13,
    },
    2: {
        1: 21,
        2: 22,
        3: 23,
    },
    3: {
        1: 24,
        2: 25,
        3: 26,
    },
}

let sum = 0;
for(let key in obj8) {
    for(let subKey in obj8[key]) {
        sum += obj8[key][subKey];
    }
}
console.log(sum);